ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="2261fcc3-938d-4df2-a64b-de5601c36355">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37cf8891-f7e5-4223-a4fe-8aa0212b88aa">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b6951ae3-bd6b-4547-a0ed-f8cb252badb3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d68151c-a9dd-450f-8139-3be6ac926f58">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c683aebd-f890-44bb-bbe3-b67f7e95b55b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9b03f67d-2b7d-4c73-a988-943a154dbef7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="75bf369d-e0ba-4ded-a392-7292f757e439">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a58e515c-907f-4bc5-9df7-29265a46385b">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_НомерСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПоставщик</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ПодписантПокупатель</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре1</name>
    <comment>Расчеты между сторонами</comment>
    <type>
      <types>CatalogRef.ЖБИ_УсловияПоОплатеВДоговоре</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре2</name>
    <comment>Сроки отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_СрокиОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_УсловиеВДоговоре3</name>
    <comment>Дополнение</comment>
    <type>
      <types>CatalogRef.ЖБИ_Дополнение</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="7b526229-3286-418a-920a-ff15a9b3ec48">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ffeb3fd7-4078-4908-9b27-a77155e26744">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5c903d97-280f-4725-81a1-6c46aa3d2e39">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="da473af6-1960-4683-b941-b8e3988be4fb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bca1976-4244-47db-9333-d6f0a0945532">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9106ea63-39cc-454e-b34b-dcf8dc95d2e4">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea68fa0a-5188-4f2e-b04a-9834dbc8adaa">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5226ecfa-b7f0-488a-95ed-b0f2cd61995b">
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e138baa-2bf3-4a9e-ad92-f5cc8efb2419">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c9795939-b692-409f-8dc0-52a5aca1dcb1">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5eb4aad6-5fc3-48f5-be2f-9045d3962e18">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="08f0de4b-9d83-4a4f-ac8b-79abaeef3771">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4ee7b1a1-d03a-410e-bd5e-a77a57f5c3ef">
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1073bd55-a7ac-4f25-b80a-94c9c106572d">
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a5a61688-4574-483f-9ddf-f2cfea450a8d">
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d63279c9-8cd6-4554-b887-089667be2e17">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b8b4deae-e12e-4990-b93f-59708fe5f787">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="783d4bd3-4cbe-4dea-8aca-c1cf630dd371">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56ee214a-9ba3-4066-89e9-3b53a7af29bc">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a0952e09-6f01-42b1-a300-c940c3316f7f">
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0883a58c-2cb3-470f-9ab2-dcd4c1f54b3d">
      <name>СрокПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЖБИ_НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="9f879343-e818-451b-aa4c-fd188e373135">
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/CommonForms/ДокументыПоДоговору/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ПереопределитьЗапросСписка()
	
	ТекстЗапроса = "ВЫБРАТЬ
					|	РеестрДокументов.Ссылка КАК Ссылка,
					|	РеестрДокументов.НомерДокументаИБ КАК Номер,
					|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
					|	РеестрДокументов.Статус КАК Статус,
					|	РеестрДокументов.Проведен КАК Проведен,
					|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления,
					|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
					|	РеестрДокументов.Партнер КАК Партнер,
					|	РеестрДокументов.Контрагент КАК Контрагент,
					|	РеестрДокументов.Договор КАК Договор,
					|	РеестрДокументов.Организация КАК Организация,
					|	РеестрДокументов.Подразделение КАК Подразделение,
					|	РеестрДокументов.МестоХранения КАК Склад,
					|	РеестрДокументов.Валюта КАК Валюта,
					|	РеестрДокументов.Сумма КАК СуммаДокумента,
					|	РеестрДокументов.Ответственный КАК Менеджер,
					|	РеестрДокументов.Комментарий КАК Комментарий,
					|	РеестрДокументов.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
					|	РеестрДокументов.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
					|	РеестрДокументов.Дополнительно КАК Дополнительно,
					|	СостоянияЭД.СостояниеВерсииЭД КАК СостояниеВерсииЭД,
					|	ВЫБОР
					|		КОГДА ДокументыСОшибкамиПроверкиКонтрагентов.Документ ЕСТЬ NULL
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьОшибкиПроверкиКонтрагентов,
					|	ВЫБОР
					|		КОГДА РеестрДокументов.Проведен
					|			ТОГДА 0
					|		КОГДА РеестрДокументов.ПометкаУдаления
					|			ТОГДА 1
					|		ИНАЧЕ 2
					|	КОНЕЦ КАК НестандартнаяКартинка,
					|	РеестрДокументов.ДополнительнаяЗапись КАК ДополнительнаяЗапись,
					|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
					|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК ТипЗначения,
					|	&СтатусПроверки КАК СтатусПроверки,
					|	&ИндикаторПроверки КАК ИндикаторПроверки,
					|	ВЫБОР
					|		КОГДА ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) = ТИП(Документ.ЗаказКлиента)
					|			ТОГДА 
					|				ВЫРАЗИТЬ(РеестрДокументов.Ссылка КАК Документ.ЗаказКлиента).ЖБИ_НомерСпецификации
					|		ИНАЧЕ """"
					|	КОНЕЦ КАК НомерСпецификации,
					|	ВЫБОР
					|		КОГДА ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) = ТИП(Документ.ЗаказКлиента)
					|			ТОГДА 
					|				РеестрДокументов.Договор.Номер
					|		ИНАЧЕ """"
					|	КОНЕЦ КАК НомерДоговора
					|ИЗ
					|	(ВЫБРАТЬ
					|		ДанныеДокумента.Ссылка КАК Ссылка
					|	ИЗ
					|		РегистрСведений.РеестрДокументов КАК ДанныеДокумента
					|	ГДЕ
					|		ДанныеДокумента.Договор = &Договор
					|	
					|	ОБЪЕДИНИТЬ
					|	
					|	ВЫБРАТЬ
					|		ДанныеРасшифровкиПлатежа.Ссылка
					|	ИЗ
					|		(ВЫБРАТЬ
					|			ДанныеДокумента.Ссылка КАК Ссылка
					|		ИЗ
					|			Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ДанныеДокумента
					|		ГДЕ
					|			ДанныеДокумента.Ссылка В
					|					(ВЫБРАТЬ
					|						ДанныеТабличнойЧасти.Ссылка
					|					ИЗ
					|						Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
					|					ГДЕ
					|						ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
					|						И ДанныеТабличнойЧасти.Заказ = &Договор)
					|		
					|		ОБЪЕДИНИТЬ ВСЕ
					|		
					|		ВЫБРАТЬ
					|			ДанныеДокумента.Ссылка
					|		ИЗ
					|			Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
					|		ГДЕ
					|			ДанныеДокумента.Ссылка В
					|					(ВЫБРАТЬ
					|						ДанныеТабличнойЧасти.Ссылка
					|					ИЗ
					|						Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
					|					ГДЕ
					|						ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
					|						И ДанныеТабличнойЧасти.Заказ = &Договор)
					|		
					|		ОБЪЕДИНИТЬ ВСЕ
					|		
					|		ВЫБРАТЬ
					|			ДанныеДокумента.Ссылка
					|		ИЗ
					|			Документ.СписаниеБезналичныхДенежныхСредств КАК ДанныеДокумента
					|		ГДЕ
					|			ДанныеДокумента.Ссылка В
					|					(ВЫБРАТЬ
					|						ДанныеТабличнойЧасти.Ссылка
					|					ИЗ
					|						Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
					|					ГДЕ
					|						ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
					|						И ДанныеТабличнойЧасти.Заказ = &Договор)
					|		
					|		ОБЪЕДИНИТЬ ВСЕ
					|		
					|		ВЫБРАТЬ
					|			ДанныеДокумента.Ссылка
					|		ИЗ
					|			Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
					|		ГДЕ
					|			ДанныеДокумента.Ссылка В
					|					(ВЫБРАТЬ
					|						ДанныеТабличнойЧасти.Ссылка
					|					ИЗ
					|						Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
					|					ГДЕ
					|						ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
					|						И ДанныеТабличнойЧасти.Заказ = &Договор)
					|		
					|		ОБЪЕДИНИТЬ ВСЕ
					|		
					|		ВЫБРАТЬ
					|			ДанныеДокумента.Ссылка
					|		ИЗ
					|			Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеДокумента
					|		ГДЕ
					|			ДанныеДокумента.Ссылка В
					|					(ВЫБРАТЬ
					|						ДанныеТабличнойЧасти.Ссылка
					|					ИЗ
					|						Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
					|					ГДЕ
					|						ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
					|						И ДанныеТабличнойЧасти.Заказ = &Договор)
					|		
					|		ОБЪЕДИНИТЬ ВСЕ
					|		
					|		ВЫБРАТЬ
					|			ДанныеДокумента.Ссылка
					|		ИЗ
					|			Документ.ОперацияПоПлатежнойКарте КАК ДанныеДокумента
					|		ГДЕ
					|			ДанныеДокумента.Ссылка В
					|					(ВЫБРАТЬ
					|						ДанныеТабличнойЧасти.Ссылка
					|					ИЗ
					|						Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ДанныеТабличнойЧасти
					|					ГДЕ
					|						ДанныеТабличнойЧасти.Ссылка = ДанныеДокумента.Ссылка
					|						И ДанныеТабличнойЧасти.Заказ = &Договор)) КАК ДанныеРасшифровкиПлатежа) КАК ДокументыДоговора
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
					|		ПО (ДокументыДоговора.Ссылка = РеестрДокументов.Ссылка)
					|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
					|		ПО (СостоянияЭД.СсылкаНаОбъект = РеестрДокументов.Ссылка)
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыСОшибкамиПроверкиКонтрагентов КАК ДокументыСОшибкамиПроверкиКонтрагентов
					|		ПО (РеестрДокументов.Ссылка = ДокументыСОшибкамиПроверкиКонтрагентов.Документ)
					|			И (&ИспользованиеПроверкиВозможно)}
					|{ГДЕ
					|	РеестрДокументов.Ссылка.* КАК Ссылка,
					|	РеестрДокументов.МестоХранения.* КАК Склад,
					|	РеестрДокументов.Организация.* КАК Организация,
					|	РеестрДокументов.ДатаДокументаИБ КАК Дата,
					|	РеестрДокументов.НомерДокументаИБ КАК Номер,
					|	РеестрДокументов.Статус КАК Статус,
					|	РеестрДокументов.ТипСсылки КАК ТипСсылки,
					|	РеестрДокументов.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
					|	РеестрДокументов.Партнер.* КАК Партнер,
					|	РеестрДокументов.Контрагент.* КАК Контрагент,
					|	РеестрДокументов.Договор.* КАК Договор,
					|	РеестрДокументов.Подразделение.* КАК Подразделение,
					|	РеестрДокументов.Ответственный.* КАК Менеджер,
					|	РеестрДокументов.Дополнительно КАК Дополнительно,
					|	РеестрДокументов.Комментарий КАК Комментарий,
					|	РеестрДокументов.Проведен КАК Проведен,
					|	РеестрДокументов.ПометкаУдаления КАК ПометкаУдаления,
					|	((РеестрДокументов.ДатаДокументаИБ >= &НачалоПериода
					|			ИЛИ &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1))
					|			И (РеестрДокументов.ДатаДокументаИБ <= &КонецПериода
					|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))) КАК Поле2}";	

	СвойстваСписка 				= ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	//СвойстваСписка.ОсновнаяТаблица = "Справочник.Номенклатура";
	//СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДокументов,СвойстваСписка);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиДС()
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	// Опишем ревизиты формы
	ЖБИ_Данные = Новый РеквизитФормы("НомерСпецификации", Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(50)), , "№ спецификации");
	ДобавляемыеРеквизиты.Добавить(ЖБИ_Данные);	
	// Добавим новые реквизиты в форму
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ЭлементФормы				= Элементы.Добавить("НомерСпецификации",Тип("ПолеФормы"),Элементы.СписокДокументов);
    ЭлементФормы.Вид 			= ВидПоляФормы.ПолеНадписи;
    ЭлементФормы.ПутьКДанным	= "СписокДокументов.НомерСпецификации";
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ


#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
&После("ПриСозданииНаСервере")
Процедура ЖБИ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Договор) <> Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат;
	КонецЕсли;
	
	//ДоступностьРоли = ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_ОсновнаяРоль");
	//Если НЕ ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_ОсновнаяРоль") Тогда 
	//	Возврат;
	//КонецЕсли;
	
	ПереопределитьЗапросСписка();
	ДобавитьКолонкиДС();
	
КонецПроцедуры

#КонецОбласти
